src/cf/InformationRegisters/обм_Приемники_ЗагруженныеПакетыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>обм_Приемники_ЗагруженныеПакетыДанных</Name>
			<Comment>Хранит связь между ссылкой приемника и объектом входящего запроса, откуда были взяты данные для заполения приемника</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПакетДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_ПакетыДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Приемник</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/обм_команды/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ПакетыДанных_ОбновитьПриемники(пПакетыДанных) Экспорт
	
	Справочники.обм_ПакетыДанных.ОбновитьПриемники(пПакетыДанных);
	
КонецПроцедуры

Функция Приемники_ОбновитьПоследнимПакетомДанных(пСсылкиПриемников) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Приемники", пСсылкиПриемников);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоследнееЗаполнение.Приемник КАК Приемник,
	|	ПоследнееЗаполнение.ПакетДанных КАК ПакетДанных,
	|	ПоследнееЗаполнение.ПакетДанных.Обработчик КАК Обработчик
	|ИЗ
	|	РегистрСведений.обм_Приемники_ЗагруженныеПакетыДанных.СрезПоследних(, Приемник В (&Приемники)) КАК ПоследнееЗаполнение";
	
	выборка = Запрос.Выполнить().Выбрать();
	
	заполненныеПриемники = Новый Массив;
	
	загрузчик = Обработки.обм_ПакетыДанных_Обработка.Создать();
	Пока выборка.Следующий() Цикл
		приемникОбъект = загрузчик.Приемник_Заполнить(выборка.Приемник, выборка.ПакетДанных, выборка.Обработчик);
		
		объектСсылкаДругое = общ.ОбъектСсылкаДругое(приемникОбъект);
		
		Если объектСсылкаДругое = "Объект" Тогда
			заполненныеПриемники.Добавить(приемникОбъект.Ссылка); 
			
		ИначеЕсли объектСсылкаДругое = "Ссылка" Тогда
			заполненныеПриемники.Добавить(приемникОбъект);
			
		КонецЕсли;
		
	КонецЦикла;
	выборка.Сбросить();

	Возврат заполненныеПриемники;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
